In [1]:
import pandas as pd

users = pd.read_csv('BX-Users.csv',sep=';',encoding='latin-1')
users.head()

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

In [2]:
books = pd.read_csv('BX-Books.csv',sep=';',error_bad_lines=False,encoding='latin-1')
books.head()

b'Skipping line 6452: expected 8 fields, saw 9\nSkipping line 43667: expected 8 fields, saw 10\nSkipping line 51751: expected 8 fields, saw 9\n'
b'Skipping line 92038: expected 8 fields, saw 9\nSkipping line 104319: expected 8 fields, saw 9\nSkipping line 121768: expected 8 fields, saw 9\n'
b'Skipping line 144058: expected 8 fields, saw 9\nSkipping line 150789: expected 8 fields, saw 9\nSkipping line 157128: expected 8 fields, saw 9\nSkipping line 180189: expected 8 fields, saw 9\nSkipping line 185738: expected 8 fields, saw 9\n'
b'Skipping line 209388: expected 8 fields, saw 9\nSkipping line 220626: expected 8 fields, saw 9\nSkipping line 227933: expected 8 fields, saw 11\nSkipping line 228957: expected 8 fields, saw 10\nSkipping line 245933: expected 8 fields, saw 9\nSkipping line 251296: expected 8 fields, saw 9\nSkipping line 259941: expected 8 fields, saw 9\nSkipping line 261529: expected 8 fields, saw 9\n'
C:\Users\Scott\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2717: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [3]:
ratings = pd.read_csv('BX-Book-Ratings.csv',sep=';',encoding='latin-1')
ratings.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [4]:
from sklearn.preprocessing import LabelEncoder

df = pd.merge(ratings,books,on='ISBN')
df.rename(columns={'User-ID':'user_id','Book-Rating':'rating','Book-Title':'title'},inplace=True)
df.drop(['Image-URL-S','Image-URL-M','Image-URL-L'], axis=1,inplace=True)

df.head()

,user_id,ISBN,rating,title,Book-Author,Year-Of-Publication,Publisher
0,276725,034545104X,0,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books
1,2313,034545104X,5,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books
2,6543,034545104X,0,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books
3,8680,034545104X,5,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books
4,10314,034545104X,9,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books

#### What are we looking at?

In [5]:
print('Unique Counts:')
for i in df:
    print(i)
    print(df.groupby(i).user_id.count().count())
    print('')

Unique Counts:
user_id
92106

ISBN
270151

rating
11

title
241071

Book-Author
101588

Year-Of-Publication
202

Publisher
16729

In [6]:

print(df.groupby('user_id').user_id.count().describe())
x = df.groupby('user_id').user_id.count()
print('How many people have read 1 book:',len(x.loc[x==1]))
print('How many people have read between 2 and 10 books:',len(x.loc[(x<=10)&(x>1)]))
print('How many people have read more than 10 books:',len(x.loc[x>10]))

count    92106.000000
mean        11.195101
std         88.685678
min          1.000000
25%          1.000000
50%          1.000000
75%          4.000000
max      11144.000000
Name: user_id, dtype: float64
How many people have read 1 book: 51270
How many people have read between 2 and 10 books: 29994
How many people have read more than 10 books: 10842

In [7]:
print(df.groupby('title').user_id.count().describe())
x = df.groupby('title').user_id.count()
print('How many books have been read 1 once:',len(x.loc[x==1]))
print('How many books have been read between 2 and 10 times:',len(x.loc[(x<=10)&(x>1)]))
print('How many books have been read more than 10 times:',len(x.loc[x>10]))

count    241071.000000
mean          4.277312
std          16.738685
min           1.000000
25%           1.000000
50%           1.000000
75%           3.000000
max        2502.000000
Name: user_id, dtype: float64
How many books have been read 1 once: 127513
How many books have been read between 2 and 10 times: 98043
How many books have been read more than 10 times: 15515

## Item-Based Collaborative Filtering
I will only use:
- Books with more than 29 ratings 
- Users who have read more than 29 books

This will decrease the size of the dataset to something more digestible for python

In [8]:
# Create mainstream titles
mainstreamBooks = df.groupby('title').user_id.count()
mainstreamBooks = mainstreamBooks.loc[mainstreamBooks>30]

# Find users with 30 or more ratings
mainstreamUsers = df.groupby('user_id').user_id.count()
mainstreamUsers = mainstreamUsers.loc[mainstreamUsers>10]

# Keep all instances where the title is in the mainstream category
mainstream = df.loc[(df.title.isin(mainstreamBooks.index))&(df.user_id.isin(mainstreamUsers.index))]
mainstream = mainstream.pivot_table(columns='title',index='user_id',values='rating')

In [9]:
print(mainstream.shape)
print(len(mainstream.columns))
mainstream.head()

(10458, 4458)
4458

title,'Salem's Lot,10 Lb. Penalty,101 Dalmatians,16 Lighthouse Road,1984,1st to Die: A Novel,2010: Odyssey Two,204 Rosewood Lane,2061: Odyssey Three,24 Hours,...,Zen and the Art of Motorcycle Maintenance,Zen and the Art of Motorcycle Maintenance: An Inquiry into Values,Zia,Zlata's Diary: A Child's Life in Sarajevo,Zodiac: The Eco-Thriller,Zoya,"\O\"" Is for Outlaw""","\Surely You're Joking, Mr. Feynman!\"": Adventures of a Curious Character""",e,stardust
user_id,,,,,,,,,,,,,,,,,,,,,
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
99,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
242,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
243,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
254,NaN,NaN,NaN,NaN,9.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN,NaN,0.0

Create a correlation matrix of books, where each correlation is based off of at least 5 instances. Meaning at least 5 people of read each book. This will help increase the chances of getting a true correlation score.

- Eg: If a correlation between 2 books has been made from just one person, I can hardly say that they know how similar those 2 books actually are. Better leave it to normality to determine which books are similar.

In [10]:
corrMainstream = mainstream.corr(method='pearson',min_periods=10)

In [11]:
corrMainstream.head()

title,'Salem's Lot,10 Lb. Penalty,101 Dalmatians,16 Lighthouse Road,1984,1st to Die: A Novel,2010: Odyssey Two,204 Rosewood Lane,2061: Odyssey Three,24 Hours,...,Zen and the Art of Motorcycle Maintenance,Zen and the Art of Motorcycle Maintenance: An Inquiry into Values,Zia,Zlata's Diary: A Child's Life in Sarajevo,Zodiac: The Eco-Thriller,Zoya,"\O\"" Is for Outlaw""","\Surely You're Joking, Mr. Feynman!\"": Adventures of a Curious Character""",e,stardust
title,,,,,,,,,,,,,,,,,,,,,
'Salem's Lot,1.0,NaN,NaN,NaN,NaN,0.138827,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10 Lb. Penalty,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,-0.071606,NaN,NaN,NaN
101 Dalmatians,NaN,NaN,1.0,NaN,NaN,-0.190949,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16 Lighthouse Road,NaN,NaN,NaN,1.0,NaN,-0.052922,NaN,0.245952,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1984,NaN,NaN,NaN,NaN,1.0,0.027650,0.071847,NaN,NaN,NaN,...,NaN,0.620288,NaN,NaN,NaN,0.336979,NaN,NaN,NaN,NaN

In [12]:
df.head(1)

,user_id,ISBN,rating,title,Book-Author,Year-Of-Publication,Publisher
0,276725,034545104X,0,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books

In [13]:
df.title[128259]

'The Fellowship of the Ring (The Lord of the Rings, Part 1)'

In [26]:
newUser = [[0.0,'',8,'1984','','',''],
           [0.0,'',2,'101 Dalmatians','','',''],
           [0.0,'',10,'The Fellowship of the Ring (The Lord of the Rings, Part 1)','','','']]
newUser = pd.DataFrame(newUser,columns=(['user_id',
                               'ISBN',
                               'rating',
                               'title',
                               'Book-Author',
                               'Year-Of-Publication',
                               'Publisher']))
LOTR = corrMainstream.loc['The Fellowship of the Ring (The Lord of the Rings, Part 1)'].dropna()
LOTR.sort_values(ascending=False,inplace=True)
LOTR = LOTR[:10]
x = pd.DataFrame(LOTR)
x = x.reset_index()

LOTR = corrMainstream.loc['The Hobbit'].dropna()
LOTR.sort_values(ascending=False,inplace=True)
LOTR = LOTR[:10]
y = pd.DataFrame(LOTR)
y = y.reset_index()

                                               title  The Hobbit
0                                         The Hobbit    1.000000
1     The Two Towers (The Lord of the Rings, Part 2)    0.605866
2                          Girl with a Pearl Earring    0.570409
3  The Return of the King (The Lord of the Rings,...    0.518606
4                                     Fahrenheit 451    0.343180
5                             The Catcher in the Rye    0.312926
6                      The Bridges of Madison County    0.303585
7                                        Wild Animus    0.238602
8                                     Watership Down    0.228589
9                                             Misery    0.226287

In [15]:
rec_sys = pd.DataFrame()
for i in corrMainstream:
    i = corrMainstream.loc[i].dropna()
    i.sort_values(ascending=False,inplace=True)
    i = i[:100]
    i = pd.DataFrame(i)
    rec_sys = rec_sys.join(i)

In [16]:
rec_sys

Empty DataFrame
Columns: ['Salem's Lot, 10 Lb. Penalty, 101 Dalmatians, 16 Lighthouse Road, 1984, 1st to Die: A Novel, 2010: Odyssey Two, 204 Rosewood Lane, 2061: Odyssey Three, 24 Hours, 2nd Chance, 3001: The Final Odyssey, 311 Pelican Court, 3rd Degree, 4 Blondes, 50 Simple Things You Can Do to Save the Earth, 52 Deck Series: 52 Ways to Celebrate Friendship, 84 Charing Cross Road, 9-11, A 2nd Helping of Chicken Soup for the Soul (Chicken Soup for the Soul Series (Paper)), A 3rd Serving of Chicken Soup for the Soul (Chicken Soup for the Soul Series (Paper)), A 4th Course of Chicken Soup for the Soul: 101 More Stories to Open the Heart and Rekindle the Spirit, A 5th Portion of Chicken Soup for the Soul : 101 Stories to Open the Heart and Rekindle the Spirit, A Beautiful Mind: The Life of Mathematical Genius and Nobel Laureate John Nash, A Bend in the Road, A Body to Die For, A Breach of Promise (William Monk Novels (Paperback)), A Caress of Twilight (Meredith Gentry Novels (Paperback)), A Case of Need, A Certain Justice (Adam Dalgliesh Mysteries (Paperback)), A Child Called \It\": One Child's Courage to Survive", A Civil Action, A Clash of Kings (A Song of Fire and Ice, Book 2), A Clockwork Orange (Norton Paperback Fiction), A Cold Heart (Alex Delaware Novels (Paperback)), A Cold Heart: An Alex Delaware Novel, A Common Life : The Wedding Story (The Mitford Years), A Confederacy of Dunces, A Confederacy of Dunces (Evergreen Book), A Crown of Swords (The Wheel of Time, Book 7), A Cry In The Night, A Cup of Tea (Ballantine Reader's Circle), A Dangerous Fortune, A Darker Place, A Darkness More Than Night, A Day Late and a Dollar Short, A Density of Souls, A Dog's Life, A Drink Before the War (Patrick Kenzie/Angela Gennaro Novels), A Dry Spell, A False Sense of Well Being (Ballantine Reader's Circle), A Farewell to Arms (A Scribner Classic), A Fever in the Heart : Ann Rule's Crime Files, Volume III, A Fine Balance, A Game of Thrones (A Song of Ice and Fire, Book 1), A Gesture Life, A Gift To Last, A Girl Named Zippy: Growing Up Small in Mooreland Indiana (Today Show Book Club #3), A God in Ruins, A Great Deliverance, A Greek God at the Ladies' Club (Avon Romance), A Heart of Stone, A Heartbreaking Work Of Staggering Genius : A Memoir Based on a True Story, A Heartbreaking Work of Staggering Genius, A History of the World in 10 1/2 Chapters (Vintage International), A Holiday Of Love, A Is for Alibi (Kinsey Millhone Mysteries (Paperback)), A Kingdom of Dreams, A Kiss of Shadows (Meredith Gentry Novels (Paperback)), A Kiss to Remember, A Knight in Shining Armor, A Lesson Before Dying (Vintage Contemporaries (Paperback)), A Lesson Before Dying (Vintage Contemporaries), A Letter of Mary (Mary Russell Novels (Paperback)), A Light in the Attic, A Light in the Window (The Mitford Years), A Little Help from Above, A Little Magic, A Little Princess, A Long Fatal Love Chase, A Maiden's Grave, A Man Named Dave: A Story of Triumph and Forgiveness, A Man in Full, A Map of the World, A Monk Swimming, A Monk Swimming : A Memoir, A Monstrous Regiment of Women, A Morbid Taste for Bones: The First Chronicle of Brother Cadfael, A Murderous Yarn (Needlecraft Mysteries), A Natural History of the Senses, A New Song (Mitford Years (Paperback)), A Night Without Armor : Poems, A Night in Terror Tower (Goosebumps, No 27), A Night to Remember, A Painted House, A Passage to India, A Patchwork Planet, A Patchwork Planet (Ballantine Reader's Circle), A Perfect Stranger, A Pirate Looks at Fifty, ...]
Index: []

[0 rows x 4458 columns]